app/views/entities/index.html.erb

        <% credit = 0 %> <% @categories.each do |category| %> <%
        category.entities.each do |transaction| %> <% credit +=
        transaction.amount %> <% end %> <% end %> <%= "$#{credit}" %>
---
SELECT "entities".* FROM "entities" INNER JOIN "categories_entities" ON "entities"."id" = "categories_entities"."entity_id" WHERE "categories_entities"."category_id" = $1  [["category_id", 2]]