app/controllers/categories_controller.rb

  def create
    @category = Category.new(name: category_params[:name], icon: category_params[:icon], user_id: current_user.id)

    if @category.save
---
INSERT INTO "categories" ("name", "icon", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"